Revit 2026 API

# RadialArrayIsValidNumberOfMembers Method

---

This indicates whether the input count is a valid size for an array based on the document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidNumberOfMembers(
	int count,
	Document pADoc
)
```
```vb
Public Shared Function IsValidNumberOfMembers (
	count As Integer,
	pADoc As Document
) As Boolean
```
```cpp
public:
static bool IsValidNumberOfMembers(
	int count,
	Document^ pADoc
)
```
```fsharp
static member IsValidNumberOfMembers :
        count : int *
        pADoc : Document -> bool
```

#### Parameters

count Int32
     The count.
pADoc Document
     The document.

#### Return Value

Boolean True if an array can be set to the specified count in the given document, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

In project documents, the array count must be between 3 and 200. In family documents, the array count must be between 0 and 200.

#### Reference

RadialArray Class

Autodesk.Revit.DB Namespace